app/views/public_recipes/index.html.erb

              <div class="recipe-details">
                <p>Total food items: <%= recipe.recipe_foods.length %> </p>
---
SELECT "recipes".* FROM "recipes" WHERE (public = true) ORDER BY "recipes"."id" DESC
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]