app/views/recipes/show.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---

  <% if @recipe.recipe_foods.empty? %>

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
    <tbody>
      <% @recipe.recipe_foods.includes(:food).each do |recipe| %>

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
          <div class="field">
            <%= f.select :food_id,@foods.collect { |food| [food.food, food.id] }, { :prompt => 'Select food'}, required: true %>