app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)

    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Apple"], ["measurement_unit", "kg"], ["price", "23.0"], ["user_id", 1], ["created_at", "2023-11-25 07:25:35.647682"], ["updated_at", "2023-11-25 07:25:35.647682"]]

  def destroy
    @food.destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]