app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1  [["user_id", 1]]
---
    def set_inventory
      @inventory = current_user.inventories.find(params[:id])