app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" INNER JOIN "inventory_foods" ON "foods"."id" = "inventory_foods"."food_id" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 1]]
---
  def show
    @inventory = Inventory.find(params[:id])
    @inventory_foods = @inventory.inventory_foods.includes(:food)

DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def destroy
    current_user.inventories.find(params[:id]).destroy

INSERT INTO "inventories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Apple Pie"], ["user_id", 1], ["created_at", "2023-11-25 07:37:25.697891"], ["updated_at", "2023-11-25 07:37:25.697891"]]
---
  def create
    inventory = Inventory.new(user: current_user, name: params[:inventory][:name])
    respond_to do |format|
      if inventory.save