app/controllers/public_recipes_controller.rb

    def index
      @recipes = Recipe.where('public = true').order(id: :desc)
---
SELECT "recipes".* FROM "recipes" WHERE (public = true) ORDER BY "recipes"."id" DESC