app/controllers/public_recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY "recipes"."updated_at" DESC  [["public", true]]
---
  def index
    @recipes = Recipe.where(public: true).order(updated_at: :desc)