app/controllers/recipe_foods_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])