app/controllers/recipe_foods_controller.rb

  def new
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_food = RecipeFood.new
    @foods = current_user.foods.select { |food| @recipe.foods.exclude?(food) }
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]

  def edit
    @recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    recipe_food = RecipeFood.new(recipe_food_params)

    if recipe_food.save
---
INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 5], ["recipe_id", 1], ["food_id", 1], ["created_at", "2023-11-25 17:58:21.928199"], ["updated_at", "2023-11-25 17:58:21.928199"]]