app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.includes(:foods).find(params[:id])
    @user = @recipe.user
    @recipe_foods = @recipe.recipe_foods.includes(:food)
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    redirect_to public_recipes_path unless current_user

    recipe = Recipe.new(recipe_params)

    if recipe.save
---
INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy!
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 2]]

  def update
    recipe = Recipe.find(params[:id])
    recipe.update(public: !recipe.public)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", false], ["updated_at", "2023-11-25 07:54:15.142196"], ["id", 3]]