app/models/recipe.rb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
  def self.calculate_total_amount(recipe)
    total_amount = 0
    recipe.recipe_foods.includes(:food).each do |recipe_food|